In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## 7.1 누락된 데이터 처리
* Pandas 객체의 모든 기술 통계는 누락된 데이터를 배제하고 처리
* 누락된 산술 데이터 : NaN

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

* None 값 : NA 취급

In [5]:
string_data[0] = None

string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 7.1.1 누락된 데이터 골라내기
#### Series
> __dropna__ : non-null 데이터와 index 만 들어있는 Series 반환

In [6]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
# 위와 동일 코드
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

#### DataFrame
1. 모두 NA 값인 row / column 제외
2. NA 값 하나라도 포함하는 row / column 제외 
> __dropna__ : NA 값 하나라도 포함하는 __row 제외__

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3]])

cleaned = data.dropna()

In [10]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleaned

     0    1    2
0  1.0  6.5  3.0

> __how = ' all '__ : __모두 NA__ 값인 __row__ 만 제외

In [12]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

> __axis = 1__ : column 제외

In [13]:
data[4] = NA

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [14]:
data.dropna(axis=1, how='all')  # delete column where all values = NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

> __thresh =__ 원하는값(n) : n 개 이상의 값이 들어있는 row만 보기

In [15]:
df = pd.DataFrame(np.random.randn(7,3))

df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

df

          0         1         2
0  0.737590       NaN       NaN
1  1.242498       NaN       NaN
2 -1.409075       NaN -0.126840
3 -0.214995       NaN  1.713604
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

In [16]:
df.dropna()

          0         1         2
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

In [18]:
df.dropna(thresh=2)  # delete rows with only one value

          0         1         2
2 -1.409075       NaN -0.126840
3 -0.214995       NaN  1.713604
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

### 7.1.2 결측치 채우기
누락된 값을 제외시키지 않고 비어있는 데이터 메꾸기
> __fillna(__ 원하는값 __)__

In [19]:
df.fillna(0)

          0         1         2
0  0.737590  0.000000  0.000000
1  1.242498  0.000000  0.000000
2 -1.409075  0.000000 -0.126840
3 -0.214995  0.000000  1.713604
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

#### 각 column 마다 다른 값 채우기
> __fillna(__ { column_A : value_A , column_B : value_B } __)__  
새로운 객체 반환

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.737590  0.500000  0.000000
1  1.242498  0.500000  0.000000
2 -1.409075  0.500000 -0.126840
3 -0.214995  0.500000  1.713604
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

> __inplace = True__ : 기존 객체 변경

In [21]:
_ = df.fillna(0, inplace=True)

df

          0         1         2
0  0.737590  0.000000  0.000000
1  1.242498  0.000000  0.000000
2 -1.409075  0.000000 -0.126840
3 -0.214995  0.000000  1.713604
4 -0.950426  0.178721  0.805185
5  0.645798 -0.321586 -1.304132
6  0.096383 -0.138114 -1.698057

In [22]:
df = pd.DataFrame(np.random.randn(6,3))

df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

df

          0         1         2
0  0.669233 -0.632637 -1.833443
1 -0.671636  1.412137  1.011336
2  0.589845       NaN -0.526335
3 -0.471998       NaN -0.995402
4 -1.210946       NaN       NaN
5 -1.579521       NaN       NaN

In [23]:
df.fillna(method='ffill')

          0         1         2
0  0.669233 -0.632637 -1.833443
1 -0.671636  1.412137  1.011336
2  0.589845  1.412137 -0.526335
3 -0.471998  1.412137 -0.995402
4 -1.210946  1.412137 -0.995402
5 -1.579521  1.412137 -0.995402

#### 보간 메서드 
NaN 값 직전의 값으로 NaN 값을 채움  
> __method = ' ffill '__ 

> __limit =__ 횟수 : 보간 메서드를 몇 번까지 허용할지 결정

In [24]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.669233 -0.632637 -1.833443
1 -0.671636  1.412137  1.011336
2  0.589845  1.412137 -0.526335
3 -0.471998  1.412137 -0.995402
4 -1.210946       NaN -0.995402
5 -1.579521       NaN -0.995402

#### NaN 에 평균값 / 중간값 전달

In [25]:
data = pd.Series([1., NA, 3.5, NA, 7])

data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

***

## 7.2 데이터 변형

### 7.2.1 중복 제거
#### DataFrame 의 중복 row
> __.duplicated()__ : 각 row가 중복인지 아닌지 확인

In [26]:
data = pd.DataFrame({'k1':['one', 'two']*3 + ['two'],
                     'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

> __drop_duplicates()__ : duplicated 배열이 False인 DataFrame 반환

In [28]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

#### column 기반 중복 제거

In [31]:
data['v1'] = range(7)

data.drop_duplicates(['k1'])  # drop by column 'k1' (drop duplicated 'one's &'two's)

    k1  k2  v1
0  one   1   0
1  two   1   1

> __keep = ' last '__ : 마지막으로 발견된 값 반환  
default : 처음 발견된 값 유지

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 함수 / 매핑 이용한 데이터 변경
#### DataFrame의 column / Series / 배열 내 값 기반으로 데이터 형태 변환

In [33]:
# set data
data = pd.DataFrame({'food': ['bacon','pulled pork','bacon',
                              'Pastrami', 'corned beef','Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
# column to add
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [36]:
# change all text to lower case
lowercased = data['food'].str.lower()

lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

> __map__ : 한 객체 안에서 값의 부분집합 변경

In [37]:
# convert data
data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
# convert data - function

data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 7.2.3 값 치환
> __replace__ (누락값, NA 값)  
누락값을 NA 값으로 치환한 새로운 Series 생성

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.,])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

* 누락된 데이터를 나타내는 -999를 NA 값으로 치환

In [41]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

* 리스트를 이용해 여러 값을 한 번에 치환

In [45]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

* Dictionary 이용

In [43]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 축 index 이름 바꾸기

In [46]:
# set data
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio', 'Colorado', 'NewYork'],
                    columns = ['one', 'two', 'three', 'four'])

> map

In [47]:
transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEWY'], dtype='object')

In [48]:
# 변경된 축 이름 index에 대입
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEWY    8    9     10    11

> __rename__ : 원래 객체 변경하지 않고 새로운 객체 생성

In [49]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
Newy    8    9     10    11

* 사전형 이용 - 일부 축의 이름만 변경

In [51]:
data.rename(index={'OHIO':'INDIANA'},      # 'OHIO' → 'INDIANA'
            columns={'three':'peekaboo'})  # 'three' →'peekaboo'

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEWY       8    9        10    11

> inplace = True : 원본 데이터 바로 변경

In [52]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEWY       8    9     10    11

### 7.2.5 개별화와 양자화
연속적인 데이터를 개별로 분할 / 그룹별로 나누기
> __cut__ 함수 이용 : 그룹 분류

In [53]:
# set data
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

# set groups: 18-25, 25-35, 35-60, 60~
bins = [18, 25, 35, 60, 100]

# group data
cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

\- 반환되는 객체 : __Categorical__ (그룹 이름이 담긴 배열)

In [55]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [56]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

> __values_count__ : cut 결과에 대한 그룹 수

In [58]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

> __right = False__ : 포함되는 값의 범위 바꾸기. __(__ 값1 , 값2 __] → [__ 값1 , 값2 __)__

In [59]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

> __labels =__ 그룹이름 : 그룹 이름 직접 넘기기

In [60]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

> __cut ( 그룹갯수)__ : 데이터의 최소값, 최대값 기준으류 균등하게 그룹의 길이 자동으로 계산 (균등분포)  
 precision = n : 소수점 n 번째 까지 계산

In [63]:
data = np.random.rand(20)

pd.cut(data, 4, precision=2)

[(0.26, 0.5], (0.025, 0.26], (0.26, 0.5], (0.26, 0.5], (0.74, 0.97], ..., (0.025, 0.26], (0.025, 0.26], (0.26, 0.5], (0.26, 0.5], (0.74, 0.97]]
Length: 20
Categories (4, interval[float64]): [(0.025, 0.26] < (0.26, 0.5] < (0.5, 0.74] < (0.74, 0.97]]

> __qcut__ : 표본 변위치를 기반으로 데이터 나눔  
- cut : 데이터 분산에 따라 각 그룹마다 데이터 수 다르게 나뉨
- qcut : 적당히 같은 크기의 그룹으로 나뉨

In [65]:
data = np.random.randn(1000)  # normalized distribution

cats = pd.qcut(data, 4)  # divide into 4 quantiles

cats

[(0.617, 3.218], (0.617, 3.218], (-0.0475, 0.617], (-0.666, -0.0475], (-4.097, -0.666], ..., (-4.097, -0.666], (-0.666, -0.0475], (-4.097, -0.666], (-0.0475, 0.617], (-0.0475, 0.617]]
Length: 1000
Categories (4, interval[float64]): [(-4.097, -0.666] < (-0.666, -0.0475] < (-0.0475, 0.617] < (0.617, 3.218]]

In [66]:
pd.value_counts(cats)

(0.617, 3.218]       250
(-0.0475, 0.617]     250
(-0.666, -0.0475]    250
(-4.097, -0.666]     250
dtype: int64

> 변위치 직접 지정 (0 ~ 1)

In [68]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0475, 1.274], (-0.0475, 1.274], (-0.0475, 1.274], (-1.304, -0.0475], (-1.304, -0.0475], ..., (-4.097, -1.304], (-1.304, -0.0475], (-1.304, -0.0475], (-0.0475, 1.274], (-0.0475, 1.274]]
Length: 1000
Categories (4, interval[float64]): [(-4.097, -1.304] < (-1.304, -0.0475] < (-0.0475, 1.274] < (1.274, 3.218]]

### 7.2.6 특이값 찾고 제외하기

In [69]:
data = pd.DataFrame(np.random.randn(1000, 4))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029338    -0.038502     0.005521     0.024820
std       1.006838     1.003711     1.014971     1.012281
min      -3.849243    -3.055086    -2.890738    -3.179502
25%      -0.690823    -0.752927    -0.718252    -0.665378
50%       0.000367    -0.033035     0.009872     0.013058
75%       0.651954     0.657635     0.676873     0.704332
max       3.651436     3.011232     2.996530     3.206088

- 하나의 column에서 절댓값 > 3 인 값 찾기

In [71]:
col = data[1]

col[np.abs(col) > 3]

474    3.011232
546   -3.055086
Name: 1, dtype: float64

- __any__ : 절대값 > 3 인 값이 들어있는 모든 row 선택

In [72]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
424 -0.747665  1.407294  1.747220 -3.179502
430  3.651436  0.673746 -0.582007  0.428888
474 -0.853665  3.011232  0.903838  0.524496
543 -3.033565 -0.457581 -0.949711  0.902669
546  0.662906 -3.055086  0.679842 -0.628570
737  0.179886 -1.082140 -0.533073  3.206088
760 -3.849243 -2.557417 -0.040017 -0.269939
847  3.106089 -1.018174 -0.087308 -0.096017
962  0.027240  1.265928  0.011479  3.097833

- -3 미만 / 3 초과하는 값 → -3 / 3 으로 지정

In [74]:
data[np.abs(data) > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.029212    -0.038459     0.005521     0.024696
std       1.001358     1.003513     1.014971     1.010808
min      -3.000000    -3.000000    -2.890738    -3.000000
25%      -0.690823    -0.752927    -0.718252    -0.665378
50%       0.000367    -0.033035     0.009872     0.013058
75%       0.651954     0.657635     0.676873     0.704332
max       3.000000     3.000000     2.996530     3.000000

> np.__sign__ ( data ) : data 값의 부호에 따라 -1 / 1 반환

In [75]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0 -1.0
1 -1.0  1.0 -1.0 -1.0
2 -1.0 -1.0  1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0  1.0 -1.0  1.0

### 7.2.7 치환과 임의 샘플링

> numpy.__random.permutation__ : Series / DataFrame의 row 를 임의 순서로 재배치  
permutaion ( 바꾸고 싶은 만큼의 길이 ) : 바뀐 순소가 담긴 정수 배열 생성

In [76]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5,4)))

sampler = np.random.permutation(5)

sampler

array([0, 4, 2, 1, 3])

- iloc 기반 탐색 / take 함수에서 사용

In [77]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [78]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

> __sample__ : 치환 없이 일부만 임의로 선택

In [79]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
3  12  13  14  15

> __replace = True__ : 반복 선택 허용. 표본을 치환을 통해 생성

In [82]:
choices = pd.Series([5, 7, -1, 6, 4])

draws = choices.sample(10, replace=True)

draws

1    7
2   -1
2   -1
1    7
0    5
4    4
1    7
2   -1
2   -1
0    5
dtype: int64

 ### 7.2.8 표시자 / 더미 변수 계산
 분류값을 __더미 / 표시자__ 행렬로 전환
 > __get_dummies__ : k 가지의 값이 있는 DataFrame의 한 column이 있다면 __k개의 column이 있는 DataFrame/행렬 생성 → 값을 0 / 1로 채움__

In [84]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'], 'data1':range(6)})

print(df)

pd.get_dummies(df['key'])

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

> __prefix__ : DataFrame 안의 column에 __접두어(prefix) 추가 후 다른 데이터와 병합__

In [85]:
dummies = pd.get_dummies(df['key'], prefix='key')

df_with_dummy = df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

***
## 7.3 문자열 다루기

### 7.3.1 문자열 객체 메서드
> __split__ : 쉼표로 구분된 문자열 분리

In [86]:
val = 'a, b, guido'

val.split(',')

['a', ' b', ' guido']

> __strip__ : 공백 문자 (줄바꿈 문자 포함) 제거

In [88]:
pieces = [x.strip() for x in val.split(',')]

pieces

['a', 'b', 'guido']

> 더하기 연산 : 분리된 문자열 합치기

In [89]:
first, second, third = pieces

first + '::' + second + '::' +third

'a::b::guido'

> __join__ : 리스트/튜플을 문자열로 전달해서 합치기

In [90]:
'::'.join(pieces)

'a::b::guido'

> __in__: 일치하는 부분 문자열의 위치 찾기

In [91]:
'guido' in val

True

In [92]:
val.index(',')

1

In [93]:
val.find(':')

-1

In [94]:
val.index(':')

ValueError: substring not found

\- 문자열을 찾지 못한 경우  
        find : -1 반환  
        index : 예외발생

> __count__ : 특저 부분문자열이 몇 번 발견되었는지 반환

In [95]:
val.count(',')

2

> __replace__ ('대체할 문자열', '새로운 문자열'): 찾아낸 패턴(대체할 문자열)을 다른 문자열(새로운 문자열)로 치환  
대체할 문자열에 비어있는 문자열 → 패턴 삭제

In [96]:
val.replace(',', '::' )

'a:: b:: guido'

In [97]:
val.replace(',', '')

'a b guido'

### 7.3.2 정규 표현식
파이썬 내장 모듈 __re__ 사용
> 문자열 분리  

* 여러 가지 공백 문자 포함된 문자열 나누기 : 공백 문자 __\s+__

In [99]:
import re

text = "foo bar\t baz \tqux"

re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [100]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

> __findall__ : 정규 표현식에 매칭되는 모든 패턴의 목록 얻기  
일치하는 모든 부분문자열 반환

In [101]:
regex.findall(text)

[' ', '\t ', ' \t']

> __search__ : 패턴과 일치하는 첫 번째 존재 반환  

> __match__ : 문자열의 시작 부분에서 일치하는 것만 반환

In [111]:
text = """
Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags = re.IGNORECASE)

- findall 이용 - 이메일 주소 리스트 생성

In [112]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

- search : 첫 번째 이메일 주소만 찾음

In [113]:
m = regex.search(text)
m

In [114]:
text[m.start():m.end()]

'dave@google.com'

- match : 정규 표현 패턴이 문자열 내에서 위치하는 시작점 & 끝점만 반환  
    문자열의 시작점에서부터 일치하는지 검사

In [115]:
print(regex.match(text))

None

- sub ('새로운 문자열', 찾은 패턴) : 찾은 패턴을 주어진 문자열로 치환 → 새로운 문자열 반환

In [116]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

- findall : 패턴에 그룹이 존재한다면 - 튜플의 목록 반환

In [118]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

- sub : __\n__ 이용해 n 번째로 찾을 그룹 반환

In [119]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### 7.3.3 pandas의 벡터화된 문자열 함수
__Series__
> __str__ 속성 : NA 값 건너뛰기

In [122]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [123]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [124]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

- 정규 표현식과 re 옵션 함께 사용

In [125]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [126]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

- 문자열 잘라내기

In [131]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object